brew "bat"
brew "btop"
brew "chafa"
brew "curl"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "git-town"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lsd"
brew "lua"
brew "neovim"
brew "openssh"
brew "openssl@3"
brew "poppler"
brew "pinentry-mac"
brew "ripgrep"
brew "resvg"
brew "stow"
brew "tmux"
brew "vivid"
brew "wget"
brew "yazi"
brew "ykman"
brew "yq"
brew "zinit"
brew "zoxide"
brew "zsh"

brew "derailed/k9s/k9s"
brew "jandedobbeleer/oh-my-posh/oh-my-posh", args: ["formula"]

cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "git-credential-manager"
cask "hyperkey"
cask "yubico-authenticator"
