tap "bufbuild/buf"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/command-not-found"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
brew "openssl@3"
brew "aws-sam-cli"
brew "python@3"
brew "awscli"
brew "bat"
brew "btop"
brew "chafa"
brew "colima"
brew "curl"
brew "direnv"
brew "docker", args: ["formula"]
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-town"
brew "go"
brew "imagemagick"
brew "jq"
brew "lua"
brew "neovim"
brew "neovim-remote"
brew "nowplaying-cli"
brew "nvm"
brew "openssh"
brew "opentofu"
brew "poppler"
brew "protobuf"
brew "resvg"
brew "ripgrep"
brew "sqlfluff"
brew "stow"
brew "switchaudio-osx"
brew "terraform"
brew "trivy"
brew "tmux", args: ["HEAD"]
brew "wget"
brew "yazi"
brew "yq"
brew "zinit"
brew "zoxide"
brew "zsh"
brew "bufbuild/buf/buf"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/terraform"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "jesseduffield/lazygit/lazygit"
cask "font-fira-code-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "git-credential-manager"
cask "gcloud-cli"
cask "rectangle"
