brew "aws-sam-cli"
brew "python@3"
brew "awscli"
brew "bat"
brew "btop"
brew "chafa"
brew "colima"
brew "cosign"
brew "crane"
brew "curl"
brew "direnv"
brew "docker", args: ["formula"]
brew "docker-buildx"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fnm"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "git-town"
brew "go"
brew "imagemagick"
brew "jq"
brew "kubectl"
brew "lazygit"
brew "lua"
brew "lsd"
brew "neovim"
brew "openssh"
brew "openssl@3"
brew "opentofu"
brew "oras"
brew "pinentry-mac"
brew "poppler"
brew "protobuf"
brew "resvg"
brew "ripgrep"
brew "sops"
brew "stow"
brew "tmux"
brew "uv"
brew "wget"
brew "yazi"
brew "ykman"
brew "yq"
brew "zinit"
brew "zoxide"
brew "zsh"

brew "bufbuild/buf/buf"
brew "derailed/k9s/k9s"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/terraform"
brew "jandedobbeleer/oh-my-posh/oh-my-posh", args: ["formula"]
brew "oven-sh/bun/bun"

cask "1password-cli@beta"
cask "antigravity"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "git-credential-manager"
cask "gcloud-cli"
cask "hyperkey"
cask "visual-studio-code"
