# required packages -- do not edit

brew "bat"
brew "btop"
brew "chafa"
brew "curl"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "git-town"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lsd"
brew "lua"
brew "neovim"
brew "openssh"
brew "openssl@3"
brew "poppler"
brew "pinentry-mac"
brew "ripgrep"
brew "resvg"
brew "stow"
brew "tmux"
brew "vivid"
brew "wget"
brew "yazi"
brew "ykman"
brew "yq"
brew "zinit"
brew "zoxide"
brew "zsh"

brew "derailed/k9s/k9s"
brew "jandedobbeleer/oh-my-posh/oh-my-posh", args: ["formula"]

cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "git-credential-manager"
cask "hyperkey"
cask "yubico-authenticator"

# profile packages

brew "actions-up"
brew "asciinema"
brew "agg"
brew "bash"
brew "ccusage"
brew "colima"
brew "cosign"
brew "crane"
brew "direnv"
brew "docker", args: ["formula"]
brew "docker-buildx"
brew "docker-compose"
brew "dotnet"
brew "figlet"
brew "fnm"
brew "forgejo-cli"
brew "libusb"
brew "glib"
brew "go"
brew "harfbuzz"
brew "helm"
brew "kubernetes-cli"
brew "mas"
brew "opentofu"
brew "oras"
brew "pkgconf"
brew "protobuf"
brew "shellcheck"
brew "sops"
brew "tflint"
brew "uv"
brew "yt-dlp"
brew "wallpaper"

brew "anomalyco/tap/opencode"
brew "bufbuild/buf/buf"
brew "controlplaneio-fluxcd/tap/flux-operator"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"

# cask "antigravity"
# cask "antigravity-cli"
cask "claude"
cask "claude-code@latest"
cask "gcloud-cli"
cask "google-drive"
cask "home-assistant"
cask "parallels"
cask "protonvpn"
cask "rectangle"
cask "unifi-identity-endpoint"

mas "CleanMyMac", id: 1339170533
mas "Developer", id: 640199958
mas "IPCams", id: 1045600272
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
